Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: // true because 4 is equal to 4, and "dog" is equal to "dog"
ja: （４は４と等しく、「dog」は「dog」と等しいので真）

source: // try applies to both function calls
ja: （tryは、両方の関数呼び出しに適用されます）

source: // Error: names don't match
ja: （エラー: 名前が一致しない）

source: // No warning
ja: （警告なし）

source: // OK: names match
ja: （OK: 名前が一致）

source: // both x and y are labeled
ja: （xとyの両方ともラベルをつけられます）

source: // greenComponent is 0x66, or 102
ja: （greenComponent は 0x66 または 102 です）

source: // redComponent is 0xCC, or 204
ja: （redComponent は 0xCC または 204 です）

source: // Still ambiguous
ja: （依然あいまい）

source: // Unambiguous
ja: （あいまいさ無し）

source: // someTuple is of type (top: Int, bottom: Int)
ja: （someTupleは型 (top: Int, bottom: Int) です）

source: // unowned capture
ja: （非所有キャプチャ）

source: // weak capture
ja: （弱いキャプチャ）

source: A break statement ends program execution of a loop, an if statement, or a switch statement.
ja: break文は、ループ、if文、またはswitch文のプログラム実行を終えます。

source: A continue statement ends program execution of the current iteration of a loop statement but does not stop execution of the loop statement.
ja: continue文は、ループ文の現在の繰り返しのプログラム実行を終了しますが、ループ文の実行は止めません。

source: A defer statement defers execution until the current scope is exited.
ja: defer文は、現在のスコープが終了されるまで実行を延期します。

source: A defer statement has the following form:
ja: defer文は以下の形式を持ちます：

source: A defer statement is used for executing code just before transferring program control outside of the scope that the defer statement appears in.
ja: defer文は、defer文が現れるスコープの外側にプログラムの制御を移す直前でのコード実行のために使われます。

source: A do statement creates a new containing scope, which allows errors to be propagated to one or more catch clauses.
ja: do文はひとつの新しく取り囲んでいるスコープを作成します、それはエラーに１つ以上のcatch節に伝えられることを可能にします。

source: A do statement has the following form:
ja: do文は以下の形式を持ちます：

source: A do statement in Swift is similar to curly braces ({}) in C used to delimit a code block, and does not incur a performance cost at runtime.
ja: スウィフトのdo文は、Cにおいてひとつのコードのブロックの境界を定めるために使われる波括弧（{}）に似ていて、実行時に性能上の損失を被りません。

source: A fallthrough statement can appear anywhere inside a switch statement, not just as the last statement of a case block, but it can’t be used in the final case block.
ja: fallthrough文は、switch文のどこにでも現れることができます、あるケース節ブロックの最後の文としてだけではなく、しかしそれは最後のケース節ブロックにおいては使われることができません。

source: A fallthrough statement consists of the fallthrough keyword and occurs only in a case block of a switch statement.
ja: fallthrough文は、fallthroughキーワードから成って、switch文のケース節ブロックだけに現れます。

source: A for-in statement allows a block of code to be executed once for each item in a collection (or any type) that conforms to the Sequence [https://developer.apple.com/documentation/swift/sequence] protocol.
ja: for-in文は、コードの１ブロックをSequence [https://developer.apple.com/documentation/swift/sequence]プロトコルに準拠するあるコレクション（または何らかの型）の中のそれぞれの項目に対して一度だけ実行されるようにします。

source: A for-in statement has the following form:
ja: for-in文は、以下の形式を持ちます：

source: A guard statement has the following form:
ja: guard文は以下の形式を持ちます：

source: A guard statement is used to transfer program control out of a scope if one or more conditions aren’t met.
ja: guard文は、１つ以上の条件が満たされないならば、プログラムの制御をあるスコープの外に転移させるために使われます。

source: A guard statement, like an if statement, executes statements depending on the Boolean value of an expression.
ja: guard文は、if文と同じく、ある式のブール値に基づいて他の文を実行します。

source: A repeat-while statement allows a block of code to be executed one or more times, as long as a condition remains true.
ja: repeat-while文は、ある条件が真のままである限り、ひとかたまりのコードを一回以上実行されるようにします。

source: A repeat-while statement has the following form:
ja: repeat-while文は、以下の形式を持ちます：

source: A repeat-while statement is executed as follows:
ja: repeat-while文は、次のように実行されます：

source: A return statement can consist of only the return keyword, or it can consist of the return keyword followed by an expression, as shown below.
ja: return文はキーワードreturnだけから成ることができます、あるいはそれは、以下に示すように、キーワードreturnとそれに続く式から成ることができます。

source: A return statement occurs in the body of a function or method definition and causes program execution to return to the calling function or method.
ja: return文は、関数またはメソッド定義の本文に現れて、プログラム実行を関数またはメソッド呼んでいるところに戻るようにします。

source: A switch case can name the value or values it matches to temporary constants or variables, for use in the body of the case.
ja: switchケース節は、それがマッチする値または複数の値に名前を付けて一時的な定数や変数に束縛することが、そのケース節の本文で使うために行えます。

source: A switch case can optionally contain a where clause after each pattern.
ja: switchケース節は、各パターンの後に随意にwhere節を含むことができます。

source: A switch case can use a where clause to check for additional conditions.
ja: switchケース節は、where節を、追加の条件で調べるために使うことができます。

source: A switch case that contains only a comment is reported as a compile-time error.
ja: １つのコメントだけを含むswitchケース節は、コンパイル時エラーとして報告されます。

source: A switch statement allows certain blocks of code to be executed depending on the value of a control expression.
ja: switch文は、コードの特定のブロックをある制御式の値に従って実行されるようにします。

source: A switch statement can also include a default case, introduced by the default keyword.
ja: switch文はまた、キーワードdefaultによって導入される、省略時のケース節を含むことができます。

source: A switch statement considers a value and compares it against several possible matching patterns.
ja: switch文は、ある値について考察して、それをいくつかの候補のマッチングパターンと比較します。

source: A switch statement has the following form:
ja: switch文は以下の形式を持ちます：

source: A throw statement causes a program to end execution of the current scope and begin error propagation to its enclosing scope.
ja: throw文は、プログラムに現在のスコープの実行を終了させます、そしてそれを囲んでいるスコープにエラーの伝達を始めます。

source: A throw statement consists of the throw keyword followed by an expression, as shown below.
ja: throw文は、以下のように、throwキーワードとそれに続くひとつの式から成ります。

source: A throw statement occurs in the body of a throwing function or method, or in the body of a closure expression whose type is marked with the throws keyword.
ja: throw文はスロー関数やメソッドの本文中に、またはthrowsキーワードで印される型のクロージャ式の中に現れます。

source: A try expression can’t appear on the right-hand side of a binary operator, unless the binary operator is the assignment operator or the try expression is enclosed in parentheses.
ja: try式が二項演算子の右手側に現れることは、その二項演算子が代入演算子であるかtry式が丸括弧の中に入れられるかしない限りはできません。

source: A while loop is appropriate in this case, because the length of the game is not clear at the start of the while loop.
ja: whileループはこの場合に適切なものです、なぜならゲームの長さはwhileループの開始時点ではっきりしないからです。

source: A while loop performs a set of statements until a condition becomes false.
ja: whileループは、ひとまとめにした文を、ある条件がfalseになるまで実行します。

source: A while loop starts by evaluating a single condition.
ja: whileループは、１つだけ条件を評価することによって始まります。

source: A while statement allows a block of code to be executed repeatedly, as long as a condition remains true.
ja: while文は、条件が真のままである限り、コードの１ブロックを繰り返して実行されるようにします。

source: A while statement has the following form:
ja: while文は、以下の形式を持ちます：

source: A while statement is executed as follows:
ja: while文は、次のように実行されます：

source: A willSet observer is called just before the value of the variable or property is set.
ja: willSetオブザーバーは、変数またはプロパティの値が設定される直前に呼ばれます。

source: A continue statement can consist of only the continue keyword, or it can consist of the continue keyword followed by the name of a statement label, as shown below.
ja: continue文は、以下に示すように、キーワードcontinueだけから成ることができます、また、それはキーワードcontinueとそれに続く文ラベルから成ることができます。

source: A switch statement provides an alternative to the if statement for responding to multiple potential states.
ja: switch文は、複数の起こりうる状況に応答するためにif文に代わるものを提供します。

source: A switch statement can include only one default case, which must appear at the end of the switch statement.
ja: switch文は１つの省略時のケース節だけを含むことができます、それは、switch文の終わりに現れなければなりません。

source: A break statement can consist of only the break keyword, or it can consist of the break keyword followed by the name of a statement label, as shown below.
ja: break文はキーワードbreakだけから成ることができます、あるいは、それは、以下に示すように、キーワードbreakとそれに続く文ラベルの名前から成ることができます。

source: A fallthrough statement causes program execution to continue from one case in a switch statement to the next case.
ja: fallthrough文によって、プログラム実行がswitch文の１つのケース節から次のケース節に続くようになります。

source: A CreditCard instance never outlives the Customer that it refers to.
ja: CreditCardインスタンスは、それが参照するCustomerより決して長生きしません。

source: A binary number, with a 0b prefix
ja: ２進数は、接頭辞0bつきで

source: A class declaration introduces a named class type into your program.
ja: クラス宣言は、名前をつけられたクラス型をあなたのプログラムに導入します。

source: A closure expression creates a closure, also known as a lambda or an anonymous function in other programming languages.
ja: クロージャ式はクロージャ、他のプログラミング言語ではまたlambdaまたは匿名関数として知られるものをつくります。

source: A code block is used by a variety of declarations and control structures to group statements together.
ja: コード・ブロックは、いくつかの文をまとめるために、いろいろな宣言や制御構造で使われます。

source: A compound type is a type without a name, defined in the Swift language itself.
ja: 複合の型は名前のない型です、そしてスウィフト言語自身によって定義されます。

source: A constant declaration introduces a constant named value into your program.
ja: 定数宣言は、名前をつけられた一定不変の値をあなたのプログラムにもたらします。

source: A decimal number, with no prefix
ja: 10進数は、接頭辞なしで

source: A declaration introduces a new name or construct into your program.
ja: 宣言は、新しい名前または構造物をあなたのプログラムに導入します。

source: A deinitializer declaration declares a deinitializer for a class type.
ja: デイニシャライザ宣言は、クラス型のためにデイニシャライザを宣言します。

source: A deinitializer is called immediately before a class instance is deallocated.
ja: デイニシャライザは、クラスインスタンスが割り当て解除される直前に呼ばれます。

source: A dictionary literal is an unordered collection of key-value pairs.
ja: 辞書リテラルは、「キーと値」の対の順序付けされないコレクションです。

source: A dictionary stores associations between keys of the same type and values of the same type in a collection with no defined ordering.
ja: 辞書は、同じ型のキーと同じ型の値との間の関連性をあるコレクションの中に順序を定義しないでしまっておきます。

source: A failable initializer is a type of initializer that produces an optional instance or an implicitly unwrapped optional instance of the type the initializer is declared on.
ja: 失敗できるイニシャライザは、イニシャライザの一種で、そのイニシャライザが宣言されている型の、オプショナルのインスタンスまたは暗黙的にアンラップされるオプショナルのインスタンスを生成します。

source: A forced-try expression consists of the try! operator followed by an expression that can throw an error.
ja: 強制try式は、try!演算子と後につづくエラーをスローできる１つの式から成ります。

source: A forced-value expression unwraps an optional value that you are certain is not nil.
ja: 強制された値式は、あなたがnilでないことを確信しているオプショナルの値をアンラップします。

source: A function call expression consists of a function name followed by a comma-separated list of the function’s arguments in parentheses.
ja: 関数呼び出し式は、関数名の後にその関数の引数のコンマ区切りのリストを丸括弧の中に続けることから成ります。

source: A function declaration introduces a function or method into your program.
ja: 関数宣言は、あなたのプログラムに関数またはメソッドをもたらします。

source: A function type represents the type of a function, method, or closure and consists of a parameter and return type separated by an arrow (->):
ja: 関数型は、ある関数、メソッド、またはクロージャの型を表して、矢印（->）で区切られたパラメータと戻り型から成ります：

source: A generic argument clause specifies the type arguments of a generic type.
ja: 総称体引数節は、総称体型の型引数を指定します。

source: A generic parameter clause specifies the type parameters of a generic type or function, along with any associated constraints and requirements on those parameters.
ja: 総称体パラメータ節は、総称体の型や関数の型パラメータを、それらのパラメータに関するあらゆる付随する制約と要件と一緒に指定します。

source: A hexadecimal number, with a 0x prefix
ja: 16進数は、接頭辞0xつきで

source: A key-path expression refers to a property or subscript of a type.
ja: キーパス式は、ある型のプロパティまたは添え字を参照します。

source: A key-value pair is a combination of a key and a value.
ja: 「キーと値」の対は、ひとつのキーとひとつの値の組合せです。

source: A lazy stored property is a property whose initial value is not calculated until the first time it is used.
ja: 遅延格納プロパティは、初めてそれが使われるまで、初期値が計算されないプロパティです。

source: A literal expression consists of either an ordinary literal (such as a string or a number), an array or dictionary literal, a playground literal, or one of the following special literals:
ja: リテラル式は、普通のリテラル（例えば、ある文字列または数）、配列または辞書リテラル、プレイグラウンドリテラル、または以下の特別なリテラルのうちの１つから成ります：

source: A literal is the source code representation of a value of a type, such as a number or string.
ja: リテラルは、ある型のある値をソースコードに表わしたものです、例えばある数や文字列など。

source: A metatype type refers to the type of any type, including class types, structure types, enumeration types, and protocol types.
ja: あるメタタイプ型は、クラス型、構造体型、列挙型、そしてプロトコル型を含む、何らかの型のその型に言及します。

source: A module is a single unit of code distribution—a framework or application that is built and shipped as a single unit and that can be imported by another module with Swift’s import keyword.
ja: モジュールは、コード分類の１つの単位 ― フレームワークまたはアプリケーションです、それは、単一の構成単位として構築され出荷されて、スウィフトのimportキーワードを使って別のモジュールによってインポートされることができます。

source: A named type is a type that can be given a particular name when it’s defined.
ja: 名前付きの型は、それが定義される時に特定の名前を与えられることができる型です。

source: A nonfrozen enumeration is a special kind of enumeration that may gain new enumeration cases in the future—even after you compile and ship an app.
ja: 非凍結列挙は特別な種類の列挙です、それは新しい列挙ケース節を将来に — あなたがアプリをコンパイルおよび出荷する後でさえ、手に入れるかもしれないものです。

source: A parenthesized expression consists of an expression surrounded by parentheses.
ja: 括弧に入れられた式は、丸括弧で囲まれたある式から成ります。

source: A pattern represents the structure of a single value or a composite value.
ja: あるパターンは、ある単一の値または複合の値の構造を表します。

source: A playground literal is used by Xcode to create an interactive representation of a color, file, or image within the program editor.
ja: プレイグラウンドリテラルは、Xcodeによって使われて、プログラムエディタ内でいろ、ファイル、または画像の双方向の表現を作成します。

source: A postfix operator is a unary operator that is written immediately after its operand, such as the postfix forced-unwrap operator (!) in the expression a!.
ja: 接尾辞演算子は単項演算子です、それはその演算数の直後に書かれます、例えば式a!での論理否定演算子（!）など。

source: A precedence group declaration introduces a new grouping for infix operator precedence into your program.
ja: 優先順位グループは、接中辞演算子優先順位に対する新しいグループをあなたのプログラムへ導入します。

source: A prefix operator is a unary operator that is written immediately before its operand, such as the prefix logical NOT operator (!) in the expression !a.
ja: 接頭辞演算子は単項演算子です、それはその演算数の直前に書かれます、例えば式!aでの論理否定演算子（!）など。

source: A protocol composition type defines a type that conforms to each protocol in a list of specified protocols, or a type that is a subclass of a given class and conforms to each protocol in a list of specified protocols.
ja: プロトコル合成型が定義するのは、指定されたプロトコルのリストの中の各プロトコルに準拠する型、または指定されたクラスのサブクラスであるそして指定されたプロトコルのリストの中の各プロトコルに準拠する型です。

source: A protocol declaration introduces a named protocol type into your program.
ja: プロトコル宣言は、名前をつけられたプロトコル型をあなたのプログラムに導入します。

source: A protocol defines a blueprint of methods, properties, and other requirements that suit a particular task or piece of functionality.
ja: あるプロトコル（規約）は、メソッド、プロパティ、そして他の要件からなるひとつの青写真を定義します、それは、ある特定の作業またはある機能性断片にふさわしくするものです。

source: A recursive enumeration is an enumeration that has another instance of the enumeration as the associated value for one or more of the enumeration cases.
ja: 再帰列挙は、１つ以上の列挙ケース節のための関連値としてその列挙の別のインスタンスを持つ列挙です。

source: A set stores distinct values of the same type in a collection with no defined ordering.
ja: 集合は、同じ型の異なった値をひとつのコレクションの中に決まった順序なしで格納します。

source: A source file is a single Swift source code file within a module (in effect, a single file within an app or framework).
ja: ソースファイルは、あるモジュール内の単一のスウィフトソースコード・ファイルです（実質的には、アプリまたはフレームワーク内の単一のファイル）。

source: A string is a series of characters, such as "hello, world" or "albatross".
ja: ひとつの文字列は、一連なりの文字です、例えば"hello, world"または"albatross"など。

source: A structure declaration introduces a named structure type into your program.
ja: 構造体宣言は、名前をつけられた構造体型をあなたのプログラムに導入します。

source: A subscript expression provides subscript access using the getter and setter of the corresponding subscript declaration.
ja: 添え字式は、対応する添え字宣言のゲッターとセッターを使用して、添え字アクセスを提供します。

source: A subscript declaration allows you to add subscripting support for objects of a particular type and are typically used to provide a convenient syntax for accessing the elements in a collection, list, or sequence.
ja: 添え字宣言は、特定の型のオブジェクトに対する添え字サポートを付け加えることをあなたに可能にして、コレクション、リスト、またはシーケンスの中の要素にアクセスするための便利な構文を提供するために概して使われます。

source: A superclass expression lets a class interact with its superclass.
ja: スーパークラス式は、あるクラスをそのスーパークラスと相互に作用させます。

source: A try expression consists of the try operator followed by an expression that can throw an error.
ja: try式は、try演算子と後につづくエラーをスローできる１つの式から成ります。

source: A tuple expression consists of a comma-separated list of expressions surrounded by parentheses.
ja: タプル式は、丸括弧に囲まれているコンマ区切りの式のリストから成ります。

source: A tuple pattern is a comma-separated list of zero or more patterns, enclosed in parentheses.
ja: タプルパターンは、丸括弧で囲まれた、０個以上のパターンのコンマ区切りのリストです。

source: A tuple type is a comma-separated list of types, enclosed in parentheses.
ja: タプル型は、丸括弧で囲まれた、いくつかの型からなるコンマ区切りのリストです。

source: A type alias declaration introduces a named alias of an existing type into your program.
ja: 型エイリアス宣言は、あなたのプログラムに既存の型の名前をつけられたエイリアスを導入します。

source: A type annotation explicitly specifies the type of a variable or expression.
ja: ある型注釈は、明確に変数または式の型を指定します。

source: A type identifier refers to either a named type or a type alias of a named or compound type.
ja: 型識別子は、名前付きの型か、名前付きまたは複合の型の型エイリアスに言及します。

source: A type inheritance clause is used to specify which class a named type inherits from and which protocols a named type conforms to.
ja: ある型継承節は、ある名前付きの型が継承するのはどのクラスからか、およびある名前付きの型が準拠するのはどのプロトコルに対してかを指定するために使われます。

source: A value type is a type whose value is copied when it’s assigned to a variable or constant, or when it’s passed to a function.
ja: 値型は、それが変数または定数に代入される時に、あるいは、それが関数に渡されるときに、値がコピーされる型です。

source: A value-binding pattern binds matched values to variable or constant names.
ja: 値束縛パターンは、マッチした値を変数または定数の名前に縛り付けてひとつに束ねます。

source: A variable declaration introduces a variable named value into your program and is declared using the var keyword.
ja: 変数宣言は、名前をつけられた変えられる値をあなたのプログラムにもたらします、そしてキーワードvarを使って宣言されます。

source: A variadic parameter accepts zero or more values of a specified type.
ja: 可変長パラメータは、指定された型の０個以上の値を受け取ります。

source: A weak reference is a reference that does not keep a strong hold on the instance it refers to, and so does not stop ARC from disposing of the referenced instance.
ja: 弱い参照は、それが言及するインスタンスに対する強い支配力を保たない参照です、なのでARCは参照をつけられたインスタンスを処分するのを止めません。

source: A wildcard expression is used to explicitly ignore a value during an assignment.
ja: ワイルドカード式は、代入の間に明示的に値を無視するために使われます。

source: A wildcard pattern matches and ignores any value and consists of an underscore (_).
ja: ワイルドカード・パターンは、どんな値にでもマッチして無視します、そしてアンダースコア（_）から成ります。

source: A type argument is the name of an actual concrete type that replaces a corresponding type parameter in the generic parameter clause of a generic type.
ja: 型引数は実際の具象型の名前です、それは、ある総称体型のもつ総称体パラメータ節の中の対応する型パラメータを置き換えます。

source: A type parameter is simply the name of a placeholder type (for example, T, U, V, Key, Value, and so on).
ja: 型パラメータは、単にプレースホルダ型の名前です（たとえばT、U、V、Key、Valueなど）。

source: A where clause is introduced by the where keyword followed by an expression, and is used to provide an additional condition before a pattern in a case is considered matched to the control expression.
ja: where節は、キーワードwhereのあとにひとつの式を続けることによって導入されます、そしてケース節の中のあるパターンがその制御式にマッチしたと考えられるより前に更なる条件を与えるために使われます。

source: A Swift Tour
ja: スウィフトツアー

source: A Swift constant or variable that refers to an instance of some reference type is similar to a pointer in C, but isn’t a direct pointer to an address in memory, and doesn’t require you to write an asterisk (*) to indicate that you are creating a reference.
ja: ある参照型のインスタンスに言及するスウィフト定数または変数はCの中のポインターに似ています、しかしメモリ中のアドレスへの直接のポインターでなくて、あなたに参照をつくっていることを示すために星印（*）を書くことを要求しません。

source: A Swift property does not have a corresponding instance variable, and the backing store for a property is not accessed directly.
ja: スウィフトのプロパティには対応するインスタンス変数がありません、そしてプロパティのための支援外部記憶は直接にアクセスされません。

source: A Unicode scalar value is a unique 21-bit number for a character or modifier, such as U+0061 for LATIN SMALL LETTER A ("a"), or U+1F425 for FRONT-FACING BABY CHICK ("🐥").
ja: あるユニコードスカラー値は、ある文字または修飾子のための固有な21ビットの数字です、例えばU+0061はLATIN SMALL LETTER A（"a"）に対して、またはU+1F425はFRONT-FACING BABY CHICK（"🐥"）に対してなど。

source: A capture list defines the rules to use when capturing one or more reference types within the closure’s body.
ja: 捕獲リストは、クロージャの本文内で１つ以上の参照型を捕獲するとき使用する規則を定義します。

source: A capture list is written as a comma-separated list of expressions surrounded by square brackets, before the list of parameters.
ja: キャプチャリストは、角括弧に囲まれたいくらかの式からなる「コンマ区切り」のリストとして、パラメータのリストの前に書かれます。

source: A class can inherit methods, properties, and other characteristics from another class.
ja: クラスは、メソッド、プロパティ、および他の特徴を別のクラスから継承することができます。

source: A class can override properties, methods, subscripts, and initializers of its superclass.
ja: クラスは、それのスーパークラスのプロパティ、メソッド、添え字、そしてイニシャライザをオーバーライドすることができます。

source: A class or structure can provide as many subscript implementations as it needs, and the appropriate subscript to be used will be inferred based on the types of the value or values that are contained within the subscript brackets at the point that the subscript is used.
ja: クラスや構造体はそれが必要とする多くの添え字実装を提供することが可能です、そして使用されるのに適切な添え字が、添え字が使われる時点でその添え字角括弧内に含まれる値または複数の値の型に基づいて、推論されます。

source: A class type can inherit from only one parent class, its superclass, but can adopt any number of protocols.
ja: クラス型は、ただ１つの親クラス、それのスーパークラスから継承することだけが許されます、しかし随意の数のプロトコルに準拠することはできます。

source: A class type method marked with the class declaration modifier can be overridden by a subclass implementation; a class type method marked with class final or static can’t be overridden.
ja: class宣言修飾子で印されるクラス型メソッドは、サブクラス実装によってオーバーライドされることができます；class finalまたはstaticで印されるクラス型メソッドはオーバーライドされることができません。

source: A class, structure, or enumeration type can enable syntactic sugar for function call syntax by declaring one of several methods, as described in Methods with Special Names.
ja: クラス、構造体、または列挙型は、構文糖を関数呼び出し構文に対して可能にすることが、幾つかのメソッドの１つを宣言することによって可能です、特殊名を持つメソッドで記述されるように。

source: A class, structure, or enumeration type can support function call syntax by defining a dynamicallyCall(withArguments:) method or a dynamicallyCall(withKeywordArguments:) method, as described in dynamicCallable, or by defining a call-as-function method, as described below.
ja: クラス、構造体、または列挙は、関数呼び出し構文をサポートできます。dynamicallyCall(withArguments:)メソッドまたはdynamicallyCall(withKeywordArguments:)メソッドを定義することによって、dynamicCallableにおいて記述されるように、またはcall-as-functionメソッドを定義することによって、下で記述されるように。

source: A class-only protocol is marked by its inheritance from AnyObject, as discussed in Class-Only Protocols.
ja: クラス専用プロトコルは、AnyObjectからのそれの継承によって印されます、クラス専用プロトコルにおいて議論されるように。

source: A closure can capture constants and variables from the surrounding context in which it is defined.
ja: クロージャは、それが定義される周囲の前後関係から、定数と変数を捕獲（キャプチャ）できます。

source: A closure can omit the types of its parameters, its return type, or both.
ja: クロージャは、そのパラメータの型、その戻り型、または両方を省略することができます。

source: A closure expression is nonescaping if it is called immediately or passed as a nonescaping function argument.
ja: クロージャ式は、もしそれが直接に呼び出されるか、または非脱出関数引数として渡されるならば非脱出です。

source: A closure is said to escape a function when the closure is passed as an argument to the function, but is called after the function returns.
ja: クロージャが引数として関数に渡される、しかしその関数が戻った後に呼び出されるとき、クロージャは関数を脱出すると言われます。

source: A closure may omit names for its parameters.
ja: クロージャは、そのパラメータの名前を省略することができます。

source: A closure or nested function that captures an in-out parameter must be nonescaping.
ja: in-outパラメータをキャプチャするクロージャまたは入れ子にされた関数は、非脱出でなければなりません。

source: A closure passed as the last argument to a function can appear immediately after the parentheses.
ja: 最後の引数として関数に渡されるクロージャは、丸括弧の直後に現れることができます。
